/**********************************************************************************************************
 * @文件     MicroSw.c
 * @说明     激光初始化
 * @版本  	 V1.0
 * @作者     陈志鹏
 * @日期     2021.4
**********************************************************************************************************/
#include "main.h"

/**********************************************************************************************************
*函 数 名: MicroSwConfigration
*功能说明: 激光初始化
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void MicroSwConfigration()
{
	GPIO_InitTypeDef gpio;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	gpio.GPIO_Pin = GPIO_Pin_15;
	gpio.GPIO_Mode = GPIO_Mode_OUT;
	gpio.GPIO_Speed = GPIO_Speed_100MHz;
	gpio.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOC,&gpio);
}
